# Project 3 - Part 3 - Creating a Database

Tijesunimi Odebode

## Purpose of Part 3

<i> In this part of the project, we will apply an ETL (extract, transform, load) process on the previously saved movie data, and then create a new MySQL database for the data. Finally, we will export the database to a .sql file using MySQL Workbench.

In [1]:
import json
import pandas as pd
import numpy as np
import seaborn as sns


import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# Load in the dataframe from Project 3- Part 1 as basics:
basics = pd.read_csv('Data/basics.csv.gz')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"
...,...,...,...,...,...,...,...,...,...
81082,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama
81083,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy"
81084,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
81085,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller"
81086,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"

## Transform:

In [3]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...,...,...
81082,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
81083,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81084,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
81085,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81086,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [4]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
81085,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
81085,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
81085,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
81086,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
81086,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [5]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [6]:
# Save just tconst and genres_split as new table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [7]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [8]:
# make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
81085  tt9916190         0
81085  tt9916190         2
81085  tt9916190        23
81086  tt9916362         7
81086  tt9916362        11

[151265 rows x 2 columns]

In [9]:
# Manually make dataframe with named cols from the .keys and .values
genres = pd.DataFrame({'Genre_Name': genre_map.keys(), 
                             'Genre_ID':genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Clean:

In [10]:
# drop "originalTitle" column
basics.drop(columns='originalTitle', inplace=True)
basics

,tconst,titleType,primaryTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...,...
81082,tt9914942,movie,Life Without Sara Amat,0,2019,NaN,74,Drama,[Drama]
81083,tt9915872,movie,The Last White Witch,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81084,tt9916170,movie,The Rehearsal,0,2019,NaN,51,Drama,[Drama]
81085,tt9916190,movie,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81086,tt9916362,movie,Coven,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [11]:
# drop "isAdult" column
basics.drop(columns='isAdult', inplace=True)
basics

,tconst,titleType,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...
81082,tt9914942,movie,Life Without Sara Amat,2019,NaN,74,Drama,[Drama]
81083,tt9915872,movie,The Last White Witch,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81084,tt9916170,movie,The Rehearsal,2019,NaN,51,Drama,[Drama]
81085,tt9916190,movie,Safeguard,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81086,tt9916362,movie,Coven,2020,NaN,92,"Drama,History","[Drama, History]"

In [12]:
# drop "titleType" column
basics.drop(columns='titleType', inplace=True)
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,Grizzly II: Revenge,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...
81082,tt9914942,Life Without Sara Amat,2019,NaN,74,Drama,[Drama]
81083,tt9915872,The Last White Witch,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81084,tt9916170,The Rehearsal,2019,NaN,51,Drama,[Drama]
81085,tt9916190,Safeguard,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81086,tt9916362,Coven,2020,NaN,92,"Drama,History","[Drama, History]"

In [13]:
# drop "genres" and other variants of genre columns
basics.drop(columns=['genres', 'genres_split'], inplace=True)
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0093119,Grizzly II: Revenge,2020,NaN,74
...,...,...,...,...,...
81082,tt9914942,Life Without Sara Amat,2019,NaN,74
81083,tt9915872,The Last White Witch,2019,NaN,97
81084,tt9916170,The Rehearsal,2019,NaN,51
81085,tt9916190,Safeguard,2020,NaN,90
81086,tt9916362,Coven,2020,NaN,92

## Upload Other Tables:

In [14]:
title_ratings = pd.read_csv('Data/ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1879
1  tt0000002            5.9       248
2  tt0000003            6.5      1652
3  tt0000004            5.8       161
4  tt0000005            6.2      2478

In [15]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_data.head()
# Select only required columns
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data

         imdb_id  revenue    budget certification
0              0      NaN       NaN           NaN
1      tt0312305      0.0       0.0           NaN
2      tt0326965      0.0       0.0         PG-13
3      tt0331312      0.0       0.0           NaN
4      tt0393049      0.0  300000.0           NaN
...          ...      ...       ...           ...
36882  tt9906644      0.0       0.0           NaN
36883  tt9913660      0.0       0.0           NaN
36884  tt9913936      0.0       0.0           NaN
36885  tt9914942      0.0       0.0           NaN
36886  tt9915872      0.0       0.0           NaN

[36887 rows x 4 columns]

In [16]:
tmdb_data = tmdb_data.loc[tmdb_data['imdb_id']!='0']
tmdb_data

         imdb_id      revenue       budget certification
1      tt0312305          0.0          0.0           NaN
2      tt0326965          0.0          0.0         PG-13
3      tt0331312          0.0          0.0           NaN
4      tt0393049          0.0     300000.0           NaN
5      tt0398286  592461732.0  260000000.0            PG
...          ...          ...          ...           ...
36882  tt9906644          0.0          0.0           NaN
36883  tt9913660          0.0          0.0           NaN
36884  tt9913936          0.0          0.0           NaN
36885  tt9914942          0.0          0.0           NaN
36886  tt9915872          0.0          0.0           NaN

[36877 rows x 4 columns]

In [17]:
tmdb_data = tmdb_data.drop_duplicates(subset = 'imdb_id')

## Load:

In [18]:
# Create connection string using credentials 
connection_str = "mysql+pymysql://root:1986_Iyanuoluwa@localhost/movies"

In [19]:
engine = create_engine(connection_str)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [20]:
## Check if database exists, if not, create it
if database_exists(connection_str) == False: 
    create_database(connection_str)
else: 
    print('The database already exists.')

The database already exists.

In [21]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Integer(),
    'endYear':Float(),
    'runtimeMinutes':Float()}

In [22]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_ratings_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [23]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [24]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
title_len = genres['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
genres_schema = {
    "Genre_Name":Text(title_len+1),
    'Genre_ID':Integer()}

In [25]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
title_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_data_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'revenue':Float(),
    'budget':Float()}

In [26]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)
title_ratings.to_sql('title_ratings',engine,dtype=title_ratings_schema,if_exists='replace',index=False)
title_genres.to_sql('title_genres',engine,dtype=title_genres_schema,if_exists='replace',index=False)
genres.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',index=False)
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_data_schema,if_exists='replace',index=False)

In [27]:
# Set a Primary Key for each table.
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [28]:
q = """SELECT * 
FROM title_basics
LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,None,118.0
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70.0
2,tt0069049,The Other Side of the Wind,2018,None,122.0
3,tt0088751,The Naked Monster,2005,None,100.0
4,tt0093119,Grizzly II: Revenge,2020,None,74.0

In [29]:
q = """SELECT * 
FROM title_ratings
LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1879
1  tt0000002            5.9       248
2  tt0000003            6.5      1652
3  tt0000004            5.8       161
4  tt0000005            6.2      2478

In [30]:
q = """SELECT * 
FROM title_genres
LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [31]:
q = """SELECT * 
FROM genres
LIMIT 5;"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [32]:
q = """SELECT * 
FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id  revenue      budget certification
0  tt0069049      0.0  12000000.0             R
1  tt0094859      0.0       187.0          None
2  tt0100275      0.0         0.0          None
3  tt0137204      0.0         0.0          None
4  tt0176694      0.0         0.0          None

In [33]:
## check if tables created
q= '''SHOW TABLES;'''
pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data